package com.example.soundarya_lahari_telugu;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Main5Activity extends AppCompatActivity {
TextView textView;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main5);

        textView=(TextView)findViewById(R.id.text5);
        String para="\n  సౌందర్య లహరిలోని స్తోత్రాల విషయ సారాంశం ఇక్కడ సంక్షిప్తంగా ఇవ్వబడింది. (అనువాదం కాదు)\n" +
                "\n" +
                "భగవతీ! ఈశ్వరుడు కూడా శక్తితో కూడినప్పుడే జగములను సృష్టించగలడు. శివ కేశవ చతుర్ముఖాదులచేత కూడా పరిచర్యలు పొందే నిన్ను నావంటి పుణ్యహీనుడు స్తుతించడం ఎలా సాధ్యమౌతుంది?\n" +
                "దేవి పాదరేణువు మహిమ గురించి. బ్రహ్మ విష్ణు మహేశ్వరులే దేవి పాదపరాగాన్ని గ్రహించి శక్తిమంతులౌతున్నారు\n" +
                "దేవి అజ్ఞానులకు జ్ఞానాన్ని, చైతన్య రహితులకు చైతన్యాన్ని, దరిద్రులకు సకలైశ్వర్యాలను, సంసారమగ్నులకు ఉద్ధరణను ప్రసాదించునది.\n" +
                "తక్కిన దేవతలు వరదాభయముద్రలతో దర్శనమిస్తున్నారు. లోకరక్షకురాలైన శ్రీమాత పాదములే సకలాభీష్ట ప్రదాయములు, భయాపహములు, లోకరక్షకములు.\n" +
                "త్రైలోక్యమోహినియు, శ్రీచక్ర రూపిణియు అయిన శ్రీ త్రిపురసుందరీదేవిని పూజించి విష్ణువు మోహినీ రూపమును ధరించగలిగెను. మన్మధుడు లోకములను మోహింపజేయగలుగుచున్నాడు.\n" +
                "పార్వతి కటాక్షవీక్షణం వలన మన్మధుడు ఒంటరివాడైనను, శరీరహీనుడైనను, అల్పాయుధధారియైనను లోకములను వశీకరించుకొంటున్నాడు.\n" +
                "శ్రీదేవీ స్వరూప ధ్యానం: క్వణత్కాంచీధామా - మ్రోయుచున్న చిరుగంటల మొలనూలు కలది; కుంభస్తననతా - స్తన భారముచే కొంచెము వంగినది; పరీక్షీణామధ్య - కృశించిన నడుము కలది; పరిణత శరచ్చంద్రవదన - నిండు చందమామ వంటి మోము; ధనుర్బాణాన్ పాశం సృణిమపి దధానా కరతలైః - ధనుస్సును, పుష్పబాణములను, పాశమును, అంకుశమును చేతులలో ధరించినది; త్రిపురాంతకుని అహంకారరూపియైన దేవి.\n" +
                "\"సుధా సింధోర్మధ్యే\" - దేవియొక్క ఆవాసం వర్ణన - అమృత సముద్రమున, కల్పవృక్షముల తోటలలో మణిద్వీపం గురించి.\n" +
                "వేదాంతయోగసారము - శరీరంలోని షట్చక్రాల గురించి వర్ణన - కుండలినీ యోగ విధానము (ఆరోహణ) - సహస్రార చక్రంలో సదాశివునితో కలిసి దేవి విహరించుచున్నది.\n" +
                "కుండలినీ యోగం (అవరోహణ) గురించి తెలిపే రెండ శ్లోకం - శరీరంలో నాడీ ప్రపంచం గురించి, అమృత ధారా స్రావ మార్గం గురించి.\n" +
                "శ్రీచక్రం వర్ణన - నవ చక్రాకృతమై, 44 అంచులు కలిగి శివశక్త్యుభయరూపముగా వెలయుచున్నది.\n" +
                "శ్రీలలితామహాభట్టారికామాత అనంత సౌందర్య స్తుతి, శివ సాయుజ్య ప్రసక్తి\n" +
                "దేవి కటాక్షమహిమా వైభవం వలన ఎంతటి వికారరూపుడైన ముదుసలి కూడా సుందరాంగులను మోహింపజేయగలడు.\n" +
                "షట్చక్రాలలోని సహస్రారములో ఉండు దేవి పాదప్రకాశ వైభవం.\n" +
                "సాత్విక ధ్యాన విధానం - శరత్కాలపు వెన్నెలను బోలు దేవికి నమస్కరించిన సజ్జనులకు అమృత రస తరంగిణులైన వాక్ప్రభావము లభించును.\n" +
                "రాజస ధ్యాన విధానం - అరుణాదేవిని ధ్యానించువారు సరస్వతీ సమానులగుదురు.\n" +
                "జ్ఞాన శక్తి రూపముననున్న, వశిన్యాది శక్తులతో కూడా దేవిని ధ్యానించువాడు మహాకావ్యములను వ్రాయగలడు.\n" +
                "ఇచ్ఛాశక్తి రూపమున కామరాజకూటమును అధిష్టించిన దేవిని ధ్యానించినయెడల వానికి అప్సరసలు కూడా వశులగుదురు.\n" +
                "అతి గోప్యము, గురువు ద్వారా గ్రహింపనగునది అయిన కామకలారూపము. ఇచ్ఛాజ్ఞానక్రియా శక్తి ధ్యానము.\n" +
                "విష హరము, జ్వర హరము అగు ధ్యానము - దేవిని హృదయమున నిలుపుకొనువాడు అమృతతుల్యమగు తన చూపుచే, సర్పములను గరుత్మంతుడు శమింపజేసినట్లుగా, ఎట్టి జ్వరపీడితుల సంతాపమునైన పోగొట్టగలడు.\n" +
                "యోగ ధ్యాన విశేషము - సహస్రారంలోని చంద్రకళను ధ్యానించిన వారికి పరమానందము లభించును.\n" +
                "భక్తి మహిమ - తనను భక్తితో కోర్కెలు కోరెడి దాసుల వాక్యము పూర్తి కాకుండానే దేవి వారికి దుర్లభ సాయుజ్యమును ప్రసాదించును.\n" +
                "శివశక్తుల సంపూర్ణైక్యత\n" +
                "బ్రహ్మాండము యొక్క సృష్టిలయములు దేవి కనుసన్నల ఆజ్ఞల ప్రకారమే జరుగుచున్నవి.\n" +
                "సత్వరజస్తమోగుణముల వలన ఉద్భవించిన త్రిమూర్తులకు శివాని పాదపూజయే నిజమైన పూజ.\n" +
                "మహాప్రళయంలో సర్వమూ లయమైనాగాని సతీదేవి మాంగళ్య మహిమవలన శివుడు మాత్రము విహరించుచున్నాడు.\n" +
                "జ్ఞానయోగాభ్యాసనా సారము - ఆత్మార్పణమే దేవికి సముచితమైన అర్చన- ఏది చేసినా అంతా భగవతి పూజయే అని కవి విన్నవించుకొంటున్నాడు - \"నా మాటలే మంత్రాలు, చేసే పనులన్నీ ఆవాహనాది ఉపచారాలు. నా నడకే ప్రదక్షిణం. నేను తినడమే నైవేద్యము. నిద్రించుటయే ప్రణామము. నా సమస్త కార్యములు నీకు పూజగా అవుగాక.\"\n" +
                "దేవియొక్క తాటంకములు (కర్ణ భూషణములు) అత్యంత మహిమాన్వితమైనవి. వాని సన్నిధిలో కాల ప్రభావము కూడా నిరోధింప బడును.\n" +
                "శివుడు ఇంటికి వచ్చు సమయములో దేవి ఎదురేగబోగా ఆమె కాలికి మ్రొక్కుచున్న బ్రహ్మ, విష్ణు, మహేంద్రాదుల కిరీటములు అడ్డముగానున్నవని చెలులు హెచ్చరించుచున్నారు.\n" +
                "దేవిని నిరంతరము ధ్యానించు భక్తునకు ఎట్టి సంపదలు అవసరము లేదు. వానికి ప్రళయాగ్నియే ఆరతివలె అగును.\n" +
                "దేవి నిర్బంధము కారణముగా 64 తంత్రములను శివుడు భూతలమునకు తెచ్చెను.\n" +
                "దేవీ మంత్రరాజము అయిన పంచదశాక్షరి సకలపురషార్ధ సాధకము. ఈ శ్లోకములో పంచదశాక్షరి సంకేతములతో చెప్పబడింది. (షోడశాక్షరి మంత్రము గుహ్యము. గురువు ద్వారా మాత్రమే శిష్యుడు గ్రహించవలెను. కనుక ఈ శ్లోకములో 15 అక్షరములే చెప్పబడినవి.)\n" +
                "కౌలులు బాహ్య విధానములో చేయు దేవి అర్చన వర్ణన. ఈ శ్లోకము బీజాక్షరములున్నవి. ఇది అధికారము, ఐశ్వర్యము, మోక్షము అవంటి ప్రయోజనములను కలిగించును.\n" +
                "శివశక్తుల ఐక్యత గురించి. నవ వ్యూహాత్మకమైన భైరవస్వరూపము ఇందు వర్ణితము. శివుడు ఆనంద భైరవుడు. పరాశక్తియే మహాభైరవి. వారు వేరు వేరు కాదు.\n" +
                "షట్చక్రములందున్న పృధివ్యాధి తత్వములు దేవియే. అన్ని రూపములు ఆమెయే.\n" +
                "ఆజ్ఞా చక్రమునందున్న పరమ శివునికి నమస్కారము. ఈ శ్లోకములో సూచింపబడిన శివశివాని రూపములు - పరశంభునాధుడు, పరచిదంబ.\n" +
                "విశుద్ధి చక్రము లోని దేవీ తత్వము. ఈ శ్లోకములో సూచింపబడిన శివశివాని రూపములు - వ్యోమేశ్వరుడు, వ్యోమేశ్వరి.\n" +
                "అనాహత చక్రము లోని హంస ద్వంద్వమునకు వందనము. ఈ శ్లోకములో సూచింపబడిన శివశివాని రూపములు - హంసేశ్వరుడు, హంసేశ్వరి\n" +
                "స్వాధిష్ఠాన చక్రము లోని సంవర్తాగ్నికి (అగ్ని తత్వము గలది) స్తుతి. ఈ శ్లోకములో సూచింపబడిన శివశివాని రూపములు - సంవర్తేశ్వరుడు, సమయాంబ\n" +
                "మణిపూరక చక్రము నందుండి ముల్లోకములను తడుపు నీలమేఘమునకు ధ్యానము. ఈ శ్లోకములో సూచింపబడిన శివశివాని రూపములు - మేఘేశ్వరుడు, సౌదామిని\n" +
                "మూలాధార చక్రములో నటన చేయు ఆనందభైరవునికి వందనము. ఈ శ్లోకములో సూచింపబడిన శివశివాని రూపములు - ఆదినటుడు, లాస్యేశ్వరి (ఆనంద భైరవుడు, సమయ)\n" +
                "మొదటి 41 శ్లోకములు \"ఆనంద లహరి\"యనబడును.\n" +
                "42వ శ్లోకమునుండి \"సౌందర్య లహరి\"గా భావింపబడుచున్నది.\n" +
                "\n" +
                "\n" +
                "ద్వాదశాదిత్యులనే మణులతో కూర్చబడిన దేవి కిరీటం వర్ణన.\n" +
                "దేవి కురులు అజ్ఞానమును నశింపజేయునని వర్ణన.\n" +
                "దేవి పాపట నడుమనున్న సింధూరము ఉదయించుచున్న సూర్యునివలెనున్నది.\n" +
                "ముంగురులచే కమ్ముకొనిన దేవి ముఖము పద్మమును పరిహసించుచున్నది. ఆమె చిరునగవు శివుని మోహింపజేయుచున్నది.\n" +
                "లావణ్యకాంతితో నిర్మలమైన దేవి ఫాలము రెండవ చంద్రఖండమువలెనున్నది. మొదటి చంద్రఖండమును దేవి తలయందు ధరించింది.\n" +
                "దేవి కనుబొమలు ధనుస్సువలెనున్నవి. ఆమె సకల భువనముల భయమును పోగొట్టెడు ఉమాదేవి.\n" +
                "దేవి కుడికన్ను సూర్యునివలె పగటిని, ఎడమకన్ను చంద్రునివలె రాత్రిని చేయుచున్నవి. మూడవ నేత్రము సంధ్యాకాలమును కలిగించుచున్నది.\n" +
                "దేవి చూపు విపులమై, మంగళకరమై, దుర్జయమై, దయారసపూరితమై, అవ్యక్త మధురమై, పరిపూర్ణ భోగవతియై, భక్తులను రక్షించునదై అనేక నగరముల బహుముఖవిజయము కలదై యున్నది.\n" +
                "దేవి నేత్రద్వయము ఆకర్ణాంతము విస్తరించి నల్లని తుమ్మెదలవలె నున్నవి. కావ్యరస మాధుర్యభరితమైన చెవులనెడు పుష్పములనుండి మకరందమునాస్వాదించుచున్నవి. వాటిని చూచి అసూయచే మూడవ కన్ను కొంచెము ఎరుపెక్కినది.\n" +
                "శ్రీ అమ్మవారి చూపు శివునియందు శృంగారము గలది. అన్యులయందు బీభత్సము గలది. గంగ (సవతి) యందు కోపము గలది. శివుని చరిత్రయందు అద్భుతము గలది. శివుడు ధరించిన సర్పములవలన భయమొందినది. పద్మమును మించిన సౌందర్యము గలది. చెలులయందు చిఱునగవులు గలది. నాయందు (ఆది శంకరాచార్యుని యందు లేదా భక్తునియందు) దయ గలది.\n" +
                "దేవి కన్నులు ఆమె చెవులవరకు లాగబడిన, రెప్పల వెండ్రుకలనెడు ఈకలు కలిగిన మన్మధ బాణములవలెనున్నవి. ఈశ్వరుని చిత్తమును కలచివేయుటయే ఆ బాణముల లక్ష్యము.\n" +
                "దేవి మూడు కన్నులందును కాటుక ధరించియన్నందున ఎరుపు, తెలుపు, నలుపు వర్ణములు మిళితములైయున్నవి. మహాప్రళయమునందు పరమాత్మలో లీనమైన బ్రహ్మ, విష్ణు, రుద్రులను భవానిదేవి శివునితోగూడి మరల సృజించుటకై ధరించిన సత్వ రజస్ తమో గుణములవలె ప్రకాశించుచున్నవి.\n" +
                "దేవి కన్నులలోని ఎరుపు, తెలుపు, నలుపు రంగులు ఎఱ్ఱని శోణానది, తెల్లని గంగానది, నల్లని యమునానది అనెడు తీర్ధముల పాపహరమైన సంగమము వలె యున్నవి.\n" +
                "జగన్మాత కనులు మూయుటవలన లోక సంహారము, తెరచుట వలన సృష్టి జరుగునందురు. సకల జగములను రక్షించుటకొరకై ఆమె రెప్పలు మూయకుండ ఉండునని కవి తలపు.\n" +
                "అపర్ణాదేవి కన్నులు మీనములవలెనున్నవని వర్ణన.\n" +
                "శివాని! నీ చల్లని చూపును నాపై ప్రసరింపజేయుమని ప్రార్థన.\n" +
                "పర్వతరాజపుత్రి కనుల అంచులు ధనుస్సులవలెనున్నవి. ఆ దేవి కడగంటి చూపులు బాణములను ఎక్కుపెట్టుచున్నవా అన్నట్లు ఆ కనుల అంచులను దాటి చెవులవరకు పోవుచున్నట్లు భ్రమను కలుగజేయుచున్నవి. (ఆ విశాలాక్షి కన్నులు చెవులవరకు వ్యాపించియున్నవని భావము)\n" +
                "దేవి చెక్కిళ్ళలో ప్రతిబింబించుచున్న ఆమె తాటంకముల కారణముగ ఆమె ముఖము నాలుగు చక్రములు కలిగిన మన్మధుని రథమువలె నున్నది. అట్టి సుందర ముఖము నాశ్రయించి మన్మధుడు శివునితో తలపడుటకు సంసిద్ధుడయ్యెను.\n" +
                "సరస్వతీదేవి అమృత సూక్తులను వినుచు శర్వాణి తలయూపుచున్నది. ఆమె కుండలముల ఝణంఝణ నాదములు సరస్వతి పలుకులను ప్రశంసించుచున్నవనిపించునట్లున్నవి.\n" +
                "హిమధ్వంస కీర్తిపతాకయైన దేవి నాసిక నుండి వెలువడు చల్లని నిశ్వాసము మాకు అభీష్టఫలములను ప్రసాదించును గాక.\n" +
                "దేవి ఎఱ్ఱని పెదవికి పోలిక చెప్పవలెనంటే పండిన పగడపు తీగనే సామ్యముగా చెప్పవలెను. దొండపండుతో పోల్చడం సరి కాదు.\n" +
                "చకోర పక్షులు దేవి చిఱునగవులనే వెన్నెలను గ్రోలుచున్నవి. అవి అతి మధురములైనందున అందుకు విరుగుడుగా అమృతమును పుల్లని కడుగునీళ్ళగా భావించి త్రాగుచున్నవి.\n" +
                "జగజ్జనని నాలుక ఎల్లపుడు శివుని గుణగణముల వర్ణనలు చేయుచు వెలయుచుండును. ఆమె నోటి ఎరుపు ప్రతిఫలించిన కారణముగా తెల్లని ఛాయ గలిగిన సరస్వతి మేను కూడా ఎరుపుగా అగుపించుచున్నది.\n" +
                "యుద్ధమునందు దైత్యులను జయించి తిరిగి వచ్చుచున్న కుమార స్వామి (విశాఖుడు), ఇంద్రుడు, విష్ణువులు చండాంశము (చండుడు అను శివభక్తుని భాగము) అయిన శివనిర్మాల్యమును తీసికొననిచ్చగించలేదు. వారు దేవి పాదములచెంత చేరి, తమ శిరస్త్రాణములను తొలగించి, మ్రొక్కుచు ఆమె యొసగిన కర్పూర సహిత తాంబూల శకలములను ఆతురతతో స్వీకరించుచున్నారు.\n" +
                "సరస్వతీ దేవి శివుని గాథలను ఆలపించుచుండగా వినుచు జగన్మాత ఆనందముతో తలయూపుచున్నది. దేవి ప్రశంసావాక్యములలోని వాఙ్మాధుర్యమునకు సరస్వతి వీణాతంత్రుల సవ్వడి సరికాకున్నది.\n" +
                "గిరిసుత చుబుకము తండ్రిచే ప్రేమగా పుణకబడింది. శివునికి దేవి ముఖము అద్దము కాగా ఆ అద్దమునకు పిడివంటిది ఆమె చుబుకము. దానిని పోల్చుటకు మరేదియును సాటిరాదు.\n" +
                "శివుని కౌగిలిచే రోమాంచకమైన దేవి గళము ఆమె ముఖమనెడు పద్మమునకు కాడవలెనున్నది. ఆ క్రింద అగురు బురద అలముకొనియున్న ముత్యాల కంఠహారము బురదలో కూరుకొనిపోయిన తామరతూడువలెనున్నది.\n" +
                "సంగీత రసజ్ఞురాలవగు ఓ తల్లీ! వివాహ సమయమున మంగళసూత్రము కట్టిన పిదప కట్టెడు మూడుదారములయొక్క గుర్తులా యనబడునట్లుగా నీ కంఠము లోని మూడు రేఖలు నానావిధమనోహరములైన మూడురాగములకు హద్దులవలె భాసించుచున్నవి.\n" +
                "దేవి నాలుగు చేతుల స్తుతి - (పూర్వము బ్రహ్మకు ఐదు తలలుండెడివని, అందొక తలను రుద్రుడు తన గోటితో చిదిమివేసెనని ఇతిహాసము). శివుని గోళ్ళకు భయపడిన బ్రహ్మ తన నాలుగు తలలను రక్షించుకొనుటకై నాలుగు ముఖాలతోను ఒకేమారు శ్రీమాత యొక్క సుకుమారమైన, తామరతూండ్లవంటి బాహువులను స్తుతించుచున్నాడు.\n" +
                "దేవి చేతి గోళ్ళ ప్రశంస - ఉమాదేవియొక్క చేతిగోళ్ళ సహజమైన అరుణవర్ణము పద్మముల రంగును పరిహసించుచున్నది. వాటి అందమును దేనితో పోల్చవచ్చును? లక్ష్మీదేవి విహరించునపుడు ఆమె పాదతలములందలి లాక్షారసము అంటి ఎఱ్ఱనైన కమలదళాలతో కొంతవరకు సామ్యము చెప్పవచ్చును.\n" +
                "దేవి స్తనయుగము వర్ణన - కుమారస్వామి చేతను, గజముఖునిచేతను ఒక్కసారే పాలు త్రాగబడి పాలు గారుచున్న దేవి స్తనయుగము మా కష్టములను పోగొట్టును గాక. ఆ స్తనద్వయమును చూచి గజాననుడు తన కుంభస్థలమును తల్లి అపహరించెనేమోయని కలతచెందుచున్నాడు.\n" +
                "పార్వతీదేవి వక్షోజములు కెంపులచే చేయబడిన అమృత కలశములు. కనుకనే ఆమె స్తన్యము గ్రోలిన గజాననుడు, కుమారస్వామి బాలురవలెనే యున్నారు. (వృద్ధులు అగుట లేదు)\n" +
                "అంబ కుచ ప్రదేశమునందున్న హారము గజాసురుని కుంభములందలి ముత్యములచే కూర్చబడింది. అట్టి తెల్లని స్వచ్ఛమైన హారము దేవి అధరకాంతులచే లోపల కొంచెము ఎర్రనై, ఈశ్వరుని కీర్తి, ప్రతాపము మిళితమైనట్లుగా భాసించుచున్నది.\n" +
                "దేవి స్తన్యము యొక్క మహిమ - పర్వతపుత్రి స్తన్యము ఆమె హృదయము లోని పాలకడలినుండి పుట్టిన వాఙ్మయము. కనుకనే దయతో దేవి యొసగిన స్తన్యమును గ్రోలిన ద్రవిడశిశువు ప్రౌఢకవుల మధ్య కమనీయకనియయ్యెను.\n" +
                "దేవి నాభి వర్ణన - హరుని కోపాగ్నిచే దహింపబడుచున్న మన్మధుడు ప్రాణరక్షణకొరకు పార్వతి నాభి అను సరస్సులో దూకెను. వాని శరీరమునుండి వెడలి తీగవలె సాగిన పొగనే పామర జనము ఆమె నూగారని అనుచున్నారు.\n" +
                "దేవి నూగారు వర్ణన - శివాని సన్నని నడుమునందు యమునానది సూక్ష్మతరంగములవలె (అతి చిన్నవైన) రోమావళి యున్నది. ఆమె కుచకుంభముల ఒరిపిడివలన వాని మధ్యనున్న ఆకాశము (స్థలము) నకు చోటు చాలలేదు. కనుక ఆ యాకాశము క్రిందికి జారి ఆమె నాభి రంధ్రమున చోటుచేసుకొనెనా యన్నట్లుగా అవియనిపించుచున్నవి.\n" +
                "గిరిపుత్రీ! నీ నాభి నిశ్చలమైన గంగ సుడి. స్తనములు అను పూమొగ్గలకు ఆధారమైన రోమరాజి యనెడు తీగకు పాదు. మన్మధుని పరాక్రమాగ్నికి హోమగుండము. రతీ దేవికి విహార గృహము. ఈశ్వరుని కనుల సిద్ధికి గుహాముఖము. అయి విరాజిల్లుచున్నది.\n" +
                "శైల తనయ నడుము వర్ణన : సహజముగానే కృశించింది. స్తన భారముచే వంగినది. నాభియు, వళులు (మడతలు) ను ఉన్న చోట విఱిగిపోవునో యన్నట్లున్నది. ఒడ్డు విఱిగిన నదీ తీరమున ఉన్న చెట్టువలె ఊగుచున్నది.\n" +
                "దేవి వళుల వర్ణన : మన్మధ నిర్మితములై కనక కలశములవంటి దేవి స్తనములు ఈశ్వర స్మరణచేత సారెకు ప్రక్కలయందు చెమర్చుచు రవికను పిగుల్చుచున్నవి. చంకలను ఒరయుచున్నవి. ఆ కుచ భారమునకు నడుము విరిగిపోకుండా కాపాడుటకై దేవి వళులు (నడుముపైని మూడు ముడుతలు) లవలీలతచే కట్టబడిన మూడు కట్లవలెనున్నవి.\n" +
                "దేవి నితంబము వర్ణన: పార్వతీ! నీ తండ్రి యగు క్షితిధరపతి భూమినుండి విస్తారమును తీసి నీకు అరణముగా నిచ్చెను. అందున నీ నితంబము (పిఱుదులు) విస్తారమై వసుమతి (భూమి) ని కప్పివైచుచు తేలిక చేయుచున్నవి.\n" +
                "భవతి తొడలు, మోకాళ్ళ వర్ణన : పార్వతీదేవి తొడలు గజరాజు తుండములను, బంగారపు అరటి కంబములను జయించునవి. భర్తకు సదా మ్రొక్కుచుండుటచే ఆమె మోకాళ్ళు గట్టిపడినవి.\n" +
                "83 నుండి 91వ శ్లోకము వరకు దేవి పాదములు, గోళ్ళ వర్ణన యున్నది.\n" +
                "\n" +
                "\n" +
                "గిరిసుతా! ఈశ్వరుని గెలుచుట కొఱకు మన్మధుడు నీ పిక్కలను పదేసి బాణములున్న అమ్ముల పొదులుగా చేసికొనెను. (ఎందుకంటే మన్మధుని దగ్గర ఉన్న ఐదే బాణాలు చాలవని). వాని చివరల నీ గోటికొనలనెడు బాణాగ్రములు (ములుకులు) కనుపించుచున్నవి. ఆ బాణాగ్రములు (అమ్మవారి పాదములకు మ్రొక్కుచున్న) దేవతల కిరీటములచే పదునుపెట్టబడియున్నవి.\n" +
                "మాతా! నీ పాదములు వేదములకు శిరోభూషణములు. నీ పాద్య జలమే శివుని జటాజూటముననున్న గంగ. విష్ణువు తలపైనున్న చూడామణి కాంతియే నీ శ్రీ పాదముల లత్తుక శోభ. తల్లీ నీ పాదములను దయతో నా శిరసుపైనుంచుమమ్మా.\n" +
                "దేవీ! తడి లత్తుకతో కాంతులీనెడు నీ పాదద్వయమునకు మ్రొక్కెదను. నీ పాదముల తాకిడిని పొందుచున్న ప్రమదావనము లోని అశోకవృక్షమును చూచి శివుడు అసూయ చెందుచున్నాడు.\n" +
                "ప్రణయ కలహ సమయమున దేవి తన కాలితో శివుని లలాటమున తన్నినది. అప్పుడు ఆమె అందెల మోత యెట్లున్నది? తన శత్రువైన శివునికి పరాభవము కలిగినందుకు మన్మధుడు కిలకిల నవ్వినట్లున్నది.\n" +
                "జననీ! శ్రీకరములు, సదా శోభాయమానములు అయిన నీపాదములను పద్మములతో ఎట్లు పోల్చనగును? పద్మములు రాత్రులు ముకుళించుకొనిపోవును. మంచు తగిలిన వడలి పోవును. అవి కొంచెము మాత్రమే లక్ష్మి అనుగ్రహమునకు పాత్రములు.\n" +
                "దేవీ! నీ పాదములు యశస్సును కలిగించునవి, విపత్తులను హరించునవి. పురారియైన శివుడు దయామయుడై వివాహ సమయమున నీ సుకుమార పాదములను తన చేతబట్టి మృదువుగా సన్నెకల్లును త్రొక్కించెను. అట్టి పాదాగ్రములను పూజ్యులైన పూర్వకవులు కఠినమైన తాబేటి పెంకుతో ఎట్లు పోల్చిరో తెలియరాదు.\n" +
                "చండీమాత పాదములు బీదలకు భద్రమైన సకలైశ్వర్యములను ప్రసాదించును. చండీమాత పాదములకు దేవతలు చేతులు జోడించి అంజలి ఘటించుచున్నారు. మాత కాలిగోళ్ళనెడు చంద్రుల కాంతికి ఆదేవతాస్త్రీల కర పద్మముల ముకుళించుచున్నట్లుగా అనిపించుచున్నది. ఆ చంద్రులు స్వర్గములో (దేవతలకు సంపదలనిచ్చెడు) కల్పవృక్షములను పరిహసించుచున్నట్లున్నది.\n" +
                "తల్లీ! నీ పాదములు ఎల్లప్పుడు కోరిన సంపదలనిచ్చునవి. సౌందర్యమనెడు మకరందమును వెదజల్లెడు కల్పవృక్షపు పుష్పగుచ్ఛములు. ఆఱు ఇంద్రియములతో (మనసు + జ్ఞానేంద్రియములు) గూడిన నా జీవము ఆఱు కాళ్ళ తుమ్మెదవలె నీపాదములను ఆశ్రయించును గాక.\n" +
                "మాతా! సుందర గమనా! నీ భవనములోని పెంపుడు హంసలు నీ నడకల తీరును నేర్చుకొన గోరి, నీ వెంటనే తిరుగుచున్నవి. నీ పాదముల మణిమంజీరములు (అందెలు) ఆ హంసలకు పదన్యాసమునందు శిక్షణ నిచ్చుచున్నట్లుగా ఉంది.\n" +
                "42వ శ్లోకము నుండి 91వ శ్లోకము వరకు శంకరాచార్యులు శ్రీమాత కిరీటము నుండి పాదములవరకు స్తుతించాడు. ఇప్పుడు దేవి సంపూర్ణ స్వరూపము వర్ణింపబడుచున్నది.\n" +
                "\n" +
                "\n" +
                "దేవీ! బ్రహ్మ, విష్ణు, మహేశ్వర, రుద్రులు నీకు సమీప సేవను పొందుటకై నీ మంచమునకు కోళ్ళుగా ఉన్నారు. శివుడు తెల్లని కాంతి అను మిషతో నీకు పైని కప్పుకొనుటకు దుప్పటియైనాడు. అట్టి సదాశివుడు నీ యెఱ్ఱని దేహకాంతులు ప్రతిఫలించిన కారణమున తానును ఎఱ్ఱబారి మూర్తీభవించిన శృంగార రసము వలెనుండి నీ కనులకు వినోదము గొలుపుచున్నాడు. (శివుని శరీర వర్ణం తెలుపు. దేవి శరీర వర్ణం ఎఱుపు.)\n" +
                "కామేశ్వరి సంపూర్ణ సౌందర్య స్తుతి - శివాణి కేశములు వక్రమైనవి. సహజ మందహాసము సరళమైనది. దేహము శిరీష పుష్పము వలె మృదువైనది. కుచ ప్రాంతము కఠినమైనది. నడుము లతవలె సన్ననైనది. నితంబములు విశాలమైనవి. సదాశివుని కరుణా శక్తి మూర్తీభవించిన రూపమే ఆ సౌందర్యమూర్తి. అట్టి అరుణాదేవి లోకములను రక్షించుటకు జయమొందుగాక.\n" +
                "సూర్యుడు దేవి పాదములవద్ద సేవ చేస్తున్నాడు. తన కిరణ తీవ్రతను ఉపశమించి, అద్దమువలె ధగదగలాడుచున్నాడు. ఆ అద్దములో దేవి ముఖపద్మము కనుపించుచున్నది. (సూర్యుని హృదయ ఫలకములో దేవి ముఖము ప్రతిబింబించుచున్నది). ఆ పద్మము సదా వికసించియున్నందున చంద్రుని బాధ లేదు (రాత్రి కాదు కనుక సూర్యుని సేవకు అంతరాయము లేదు).\n" +
                "చంద్రబింబమును దేవి అలంకరణ సామగ్రి పెట్టెగా చెప్పుట - దేవీ! చంద్రబింబము జలమయమైన మరకత మణితో చేయబడిన పెట్టె. అది కళలు అనే కర్పూరముతో నిండియున్నది. నీవు వాడుకొనే కస్తూరియే అందులో కనుపించే మచ్చ. ప్రతిదినము దీనిలోని వస్తువులను (కస్తూరిని, కర్పూర శకలాలను) నీవు వాడుకొనుచుండుట చేత ఆ పెట్టె తగ్గిపోతున్నది. (దానిలోని రంధ్రము పెద్దగా అగుచున్నది.) దానిని బ్రహ్మ మరల పూరిస్తూ ఉన్నాడు. (చంద్రునిలోని హెచ్చుతగ్గులు - కృష్ణ పక్షము, శుక్ల పక్షము).\n" +
                "దేవీ! నీవు త్రిపురారి అంతఃపురాధిదేవతవు. (శివుని పట్టపురాణివి). నీ పాదసేవ దుర్లభము. కనుక ఇంద్రాది దేవతలు నీ ద్వారముచెంత కావలిగానున్న అణిమాది సిద్ధుల ప్రసాదములతో అతులమైన ఇష్టసిద్ధులను పొంది తృప్తులగుచున్నారు.\n" +
                "సతీదేవీ! గొప్పకవులను సరస్వతీవల్లభులంటారు. గొప్ప సంపన్నులను లక్ష్మీపతులంటారు. కాని నీ కౌగిలింత మాత్రము ఈశ్వరునకు మాత్రమే లభించును. గోరింట చెట్టుకు కూడా లభించదు.\n" +
                "గిరిజా దేవీ! వేదవిదులు నిన్ను సరస్వతి యనియు, లక్ష్మి యనియు, పార్వతి యనియు చెబుతారు. కాని నీవు ఈ మువ్వురికంటె వేరైన మహామాయవు. పరబ్రహ్మయగు సదాశివుని దేవియగు చంద్ర కళగా ఆరాధింపబడు శ్రీవిద్యవు. దేశకాల పరిమితులకు అతీతమైన మహిమ గల దానవు. మహామాయవై విశ్వమును భ్రమింపజేయుచున్నావు.\n" +
                "ఉమా దేవీ! సముద్భూత స్థూల స్తనభరమైన వక్షోభాగము, మనోహరమైన దరహాసము, కడగంటి చూపులందు మన్మధులు, కదంబమువంటి ప్రభ కలిగిన తనువు - ఈ గుణములన్నియు శివుని మనస్సునందు నీవేయను భ్రాంతి కలిగించును. నిర్మలమైన మనస్సుతో దేవిని ధ్యానించు భక్తులకు ఈ గుణములు కలుగుటయే వారి భక్తికి పరమావధి.\n" +
                "తల్లీ! నేను జ్ఞానార్ధిని. నీ పాదములు కడిగినపుడు లత్తుక రసముతో ఎఱ్ఱనైన నీ పాదోదకమును త్రాగే భాగ్యము నాకెప్పుడు లభిస్తుందో? అది మూగవారిని కూడా కవులుగా చేయునది. ఆ జలమునకు సరస్వతీ దేవి ముఖ తాంబూల రస గుణము కలిగనది.\n" +
                "(ఈ శ్లోకములో షట్\u200C-కమల భేదనము, సహస్రార కమలమును చేరుకొనుట సూచింపబడినవి) దేవీ! సాదాఖ్య చంద్రకళ యగు నిన్ను భజించువాడు విద్యను, ఐశ్వర్యమును పొంది (సరస్వతిని, లక్ష్మిని వశము చేసుకొని) బ్రహ్మకును, విష్ణువునకును విరోధిగా వెలుగుచున్నాడు. రమ్యమైన రూపము పొంది రతీదేవి పాతివ్రత్యమును శిథిలము చేయగలడు. చిరంజీవియై జీవుని అవిద్యను జయించి బ్రహ్మానంద రసమును ఆస్వాదించును. (సాదాఖ్య కళను ఉపాసించు వానికి ఐహికాముష్మిక ఫలములు రెండును సిద్ధించును)\n" +
                "సర్వ జ్ఞానములకు, సకలైశ్వర్యములకు నిధియైన శ్రీదేవీ! నిత్య మందహాస వదనా! నిరవధిక గుణ నిధానమా! నీతి నిపుణా! నిరాటంక జ్ఞానా! నియమ వశమైన చిత్తములందు నివసించుదానా! నియమ విధులకు కట్టుబడని దానా! నిఖిల నిగమాంత స్తుత పదా! ఆపదలు, ఆటంకములు సమీపించని దానా! నిత్యా! నా స్తుతిని కూడా స్వీకరించు తల్లీ! (చండిక స్తోత్రము చేతను, భాస్కరుడు నమస్కారము చేతను, విష్ణువు అలంకారము చేతను, శంకరులు అభిషేకము చేతను సంతుష్టులగుదురు.)\n" +
                "సర్వ వాక్కులకు జననీ! ఈ విశ్వములోని వాక్కులన్నయును నీవే! కనుక నా స్తోత్రములోని వాక్కులు కూడా నీవే! అట్టి నీ వాక్కులచేతనే నిన్ను స్తుతించుచుంటిని. దీప కాంతులతో సూర్యునికి నీరాజనమిచ్చినట్లుగాను, చంద్రకాంత శిలా జలముచే చంద్రునికి అర్ఘ్యమిచ్చినట్లుగాను, జలములతో సముద్రుని తృప్తి పరచినట్లుగాను నేను నీ వాక్కులచేత నిన్ను స్తుతించి నీకు ప్రీతి కలిగింపనెంచితిని.శిశువు పలుకులు నిరర్ధకమైనవైనను తల్లికి ఆనందమే కలిగించును కదా! అట్లే ఈ భక్తుని స్తుతి సకల లోకమాతవగు నీకు ఆనందము కలిగించును గాక. ";
        textView.setText(para);
        textView.setMovementMethod(new ScrollingMovementMethod());
    }
}
