package com.example.soundarya_lahari_telugu;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Main6Activity extends AppCompatActivity {
TextView textView;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main6);

        textView=(TextView)findViewById(R.id.text6);
        String para="\n షట్చక్రాలు\n" +
                "(షట్చక్రములు నుండి దారిమార్పు చెందింది)\n" +
                "\n" +
                "షట్చక్రాలను సూచించే పటం - 18వ శతాబ్దానికి చెందిన చిత్రం - కాంగ్రా శైలి\n" +
                "శ్రీ విద్యలోను, వివిధ తంత్రములలోను చెప్పిన ప్రకారము మానవుని శరీరం లోని వెన్నుపూసలో ఉండే, దిగువ చెప్పిన ఆరు సూక్ష్మ స్థానాలను షట్చక్రాలు అంటారు :\n" +
                "\n" +
                "1.మూలాధార చక్రము\n" +
                "2.స్వాధిష్ఠాన చక్రము\n" +
                "3.మణిపూరక చక్రము\n" +
                "4.అనాహత చక్రము\n" +
                "5.విశుద్ధ చక్రము\n" +
                "6.ఆజ్ఞా చక్రముమూలాధార చక్రము\n" +
                "పిరుదుల స్థానమునకు పైన, లింగ స్థానమును క్రిందుగా నున్నది. నాలుగు దళములతో అరుణ వర్ణము కలిగిన కమలమిది. ఇందే కుండలినీ శక్తి యుండును. మూలాధార చక్రమున గల కమలకర్ణికయందు దివ్య సుందరమైన త్రికోణము, దాని మధ్య తటిత్కోటి సమప్రభమగు స్వయంభూలింగము కలదనియు, ఆలింగము చుట్టును తామరతూడులోని దారము వంటి ఆకారము గల కుండలినీ శక్తి మూడున్నర చుట్లు చుట్టుకొనియున్నదనియు వివిధ తంత్రములు వర్ణించుచున్నవి.\n" +
                "\n" +
                "మూలాధారచక్ర అధిష్టాన దేవత “సిద్ధవిద్యాదేవి” సాకిణీ రూపములో ఉంటుంది. ఈ దేవతకు సంబధించిన బీజ, కీలక, న్యాస మంత్రాలన్నీ “స” కార సంబంధముగా ఉంటాయి. 514 నుండి 519 వరకూ గల నామములు “సాకిన్యంబ”ను వర్ణిస్తాయి. నామములు - మూలాధారామ్భుజారూఢ, పంచవక్తాృయ, ఆస్ధిసంసితాయ, అంకుశాది ప్రహరణాయ, వరదాది నిషేవితాయ, ముద్గౌదనాసక్తాయ.\n" +
                "\n" +
                "మూలాధారస్ధపద్మే, శృతి దళలసితే, పంచవక్త్రాం త్రినేత్రాం,\n" +
                "ధూమ్రాభా, మస్ది సంస్దాం సృణి మపి కమలం పుస్తకం జ్ఞానముద్రాం\n" +
                "బిభ్రాణం బాహుదండైస్సులలిత వరదా పూర్వ శక్త్యన్వితాoతం\n" +
                "ముద్గాన్నాసక్త చిత్తాం మధుమదముదితాం సాకినీ భావయామి:\n" +
                "\n" +
                "మనలోని భౌతిక శక్తిని నియంత్రించేది మూలాధార చక్రము. ఇది షట్చక్రాలలో మొదటిది. ఇది నాలుగు దళాల పద్మము. ఈ మూలాధార చక్రములో ‘సాకిన్యాంబ’ నివసిస్తుంది. ఈమెకు ఐదు ముఖములు, శబ్దము, స్పర్శ, రూపము, రసము, గంధము అనబడే ఐదు తన్మాత్రలు ఈ మూలాధారం వద్దే పనిచేస్తాయి. గర్బస్ధ శిశువుకి ఐదవ మాసములో చర్మం ఏర్పడి పంచ జ్ఞానేంద్రియ జ్ఞానము కలుగుతుంది. ఈమె ఆస్ధి సంస్దిత అనగా ఎముకలను అంటిపెట్టుకుని ఉంటుంది. వజ్రేస్వరి. ఈ దేవతకి నాలుగు చేతులు. అంకుశము, కమలం, పుస్తకము, జ్ఞానముద్ర కలిగి ఉంటుంది.\n" +
                "\n" +
                "సాకిన్యాంబ వరదాది దేవతలు : 1. వరద 2. శ్రియ 3. షండా 4. సరస్వతి ( వ, శ, ష, స అను మూలాక్షరాల) దేవతలచే కోలువబడుతూ ఉంటుంది. ఈమెకు పెసరపప్పుతో చేసిన పులగం అంటే ఇష్టము.\n" +
                "\n" +
                "స్వాధిష్ఠాన చక్రము\n" +
                "లింగమూలమున గలదు. ఆరు దళములతో సింధూరవర్ణము గల జలతత్వ కమలము గలది.\n" +
                "\n" +
                "మణిపూరక చక్రము\n" +
                "నాభి మూలమందు గలదు. పది దళములు గలిగి నీల వర్ణము గల అగ్ని తత్వ కమలము.\n" +
                "\n" +
                "లాకిన్యంబాస్వరూపిణి: - (503) (6 నామాములు) (3 వ చక్రము) (495) నుండి (502) వరకూ నామములు : మణిపూరాబ్జనిలయ, వదనత్రయసంయుతా, వజ్రాధికాయుధోపేతాయ, డామర్యాదిభిరావృతాయ, రక్తవర్ణాయ, మాంసనిష్టాయ, గుడాన్నప్రీతాయ, సమస్తభక్త సుఖదాయ.\n" +
                "\n" +
                "దిక్పత్రే, నాభిపద్మే, త్రివదన విలస ద్దంష్ట్రిణీం, రక్తవర్ణాం,\n" +
                "శక్తిం దంభోళి దండావ భయమపి భుజైర్దారయంతీo మహోగ్రాం\n" +
                "డామర్యాద్త్యై: పరీతాం పశుజన భయదాం మాంసధాత్వేక నిష్టాం\n" +
                "గౌడన్నసక్త చిత్తాం సకల సుఖకరీం లాకినీమ్ భావయామి:\n" +
                "\n" +
                "నాభిస్తానము వద్ద గల మణిపూరచక్రమున వసించునది. పది దళముల పద్మము, బీజాక్షరాలు సంస్కృతములోని “డ” నుండి “ఫ” వరకు గల అక్షరాలు. గర్భస్తశిశువు మూడవ మాసములో కాళ్ళు, చేతులు ఏర్పడడం జరుగును. మూడు ముఖములు కలది. గర్భస్ధ శిశువుకి నోరు, ముక్కు, కళ్ళు ఏర్పడతాయి. నాలుగు చేతులు కలది. వజ్రం, శక్తి, దండము, అభయ ముద్రలు ధరించింది. డామరము ఆది దేవతలచే పరివేష్టించబడింది. ఈ సమయములోనే శిశువు శబ్దాలకి ప్రతిస్పందన చూపిస్తాడు. ఎరుపు వర్ణము కలది. మాంస ధాతువుని ఆశ్రయించేది. బెల్లంతో చేసిన పాయసం, చక్రపొంగలి లాటి వానిపై ఇష్టం కలది. అన్నిరకముల భక్తులకీ సుఖసంతోషములు కలిగించేది ఈ లాకిన్యాంబ రూపిణి.\n" +
                "\n" +
                "మణిపూరక చక్రం మంత్రం : ‘ఐం హ్రీం శ్రీం వాం హం సస్సోహం మణిపూరాధిష్టానదేవతాయై లాకినీ సహిత వైష్ణవ స్వరూపిణ్యాంబాయై నమః”\n" +
                "\n" +
                "మణిపూరకచక్రం :- ఈ కమలం పది దళములు గల జలతత్త్వం కలది. అధిదేవత లాకిని. ఈమె డ, ఢ, ణ, త, థ, ద, ధ, న, ప, ఫ అను యోగినులచే ఆరాధింపబడుచున్నది. వాహనం పొట్టేలు. 'గుడాన్నప్రీతిమానసా /సమస్త భక్తసుఖదా లాకిన్యాంబ స్వరూపిణీ/ సర్వజనులకు సుఖాలు ఇచ్చే ఈ అధిదేవతకు బెల్లపు పొంగలి ప్రీతి.\n" +
                "\n" +
                "బొడ్డునకు మూలంలో వెన్నెముకలో విలసిల్లే ఈ చక్రం మనలో 4,536 నాడులతో అనుసంధానింపబడి వుంటుంది.ఈ చక్రమందు ఉద్భవించే శక్తి మనం తీసుకునే ఆహారాన్ని జీర్ణం చేసి సారాన్ని శరీరంనకు అందిస్తుంది. ఈ చక్రంనకు పంచకోశాలలో ప్రాణామయకోశంతో సంబంధం. శారీరకవ్యవస్థలోని జీర్ణవ్యవస్థతో సంబంధం. జ్ఞానేంద్రియం నాలుక. పుట్టుట, జీవించుట, మరణించుట అను మూడు బిందువులతో కూడిన త్రికోణమే జీవసృష్టి. అట్లే మూలాధారం, స్వాధిష్టానం, మణిపూరకం అను మూడు కేంద్రాలతో ఒక త్రికోణం ఏర్పడుచున్నది. ఈ త్రికోణమే భౌతికసృష్టికాధారం. ఈ మూడు చక్రాలు భౌతిక జీవితం సజావుగా సాగడానికి సహకరిస్తాయి. ఈ చక్రం శక్తివంతంగా లేకపోతే - అవయవములయందు నీరు చేరుట, నోటికి సంబందినవ్యాధులుకు కారణమౌతుంది. నియమాలు లేని ఆహారపు అలవాట్లువలన జీర్ణశక్తి మందగించి అజీర్తి, గాస్ట్రిక్ సమస్యలు కల్గుతాయి. ఉదరకోశ వ్యాధులు, గుండె బలహీనత, నిద్రలేమి, తలబరువు, కాలేయవ్యాధులు, అతిమూత్రవ్యాధి, రక్తక్షీణత, నేత్రవ్యాధులు కల్గుతాయి.\n" +
                "\n" +
                "ఈ చక్ర మానసిక స్వభావం - మూసుకుపోవడం వలన కీర్తికండూతి, పెత్తనం చెలాయించాలనే అహం, అసూయ, అసహనం, దుడుకుతనం, క్రూరత్వం, కటుత్వం, స్వలాభపరులు, స్వార్ధపరులు. తన గురించి తాను తక్కువగా ఆలోచిస్తూ కుంగిపోవడం. తెరుచుకుంటే లక్ష్యసాధన, ఆశయసిద్ధి, వ్యవహార దక్షత, ఉత్సాహం, ధనాపేక్ష, తన్ను తాను గౌరవించుకోవడం, ఆత్మవిశ్వాసం కల్గివుండడం, జీవితంలో అన్నింటా ముందడుగు. ఇక్కడే మనిషికి ఆలోచన ఏర్పడుతుంది. అనుమానాల్ని నివృత్తి చేసుకుంటూ, చక్కగా ఆలోచిస్తూ, అన్నింటినీ అవగాహనతో విశ్లేషించుకుంటూ, విశ్వాస, వివేక జ్ఞానంలను అలవర్చుకుంటూ ముందుకు సాగాలి. మనలో విశ్వాసం, అవిశ్వాసం, నమ్మకం, అపనమ్మకం రెండూ ఏర్పడేది దీనివలనే.\n" +
                "\n" +
                "లక్ష్యసాధనకు ఉపయోగపడే చక్రం. లక్ష్యసాధనలో ఎన్నో ఆటంకాలు ఎదురవుతూ వుంటాయి. పరాజయాలు పలకరిస్తుంటాయి. ఇది సహజం. సాధిస్తాం, తప్పకుండా విజయం సాధిస్తాం అన్న ఆశావాదం పెంచుకొని, నిరాశావాదాన్ని మదినుండి తరిమివెయ్యాలి, చిన్న చిన్న అనారోగ్యాలని, అవరోధాల్ని, అవమానాల్ని కుంటిసాకులుగా చెప్పుకొని ఆగిపోక ఆత్మవిశ్వాసంతో అడుగు ముందుకు వేయాలి. ఓటమి అన్నది గుణపాఠమే గానీ, అంతిమతీర్పు కాదని గ్రహించాలి.\n" +
                "\n" +
                "మరి ఈ చక్రాన్ని ఎలా శుద్ధి చేసుకోవడం? ఈ చక్రమునకు లాకిని దేవత. సర్వజనులకు సుఖాలునిచ్చే ఈ దేవతకు బెల్లపు పులగం ప్రీతి. ఈ చక్రం బలహీనంగా వుంటే బెల్లపు పులగాన్ని స్వీకరిస్తూ, వ్యాధులబట్టి అవసరమైనచో తగు ఔషదములను వినియోగిస్తూ, బీజాక్షరం \"రం\" ధ్యానించువారికి ఈ నాడీకేంద్రం వలన వచ్చే బాధలు నివారణ కాగలవు. ఈ చక్రంలో జాగృతి తీసుకురావాలంటే - అనుభూతులను (ఆనందంగానీ, విచారం గానీ, దుఃఖం గానీ, ఆవేశం గానీ...) లోపల దాచుకోకుండా సహజంగా బయటకు వెళ్లనీయాలి. దీర్ఘంగా శ్వాసించడం చేయాలి. అలాగే ఈ చక్రానికి అధిపతి గురుడు. ఆరోగ్యంగా వుండాలన్న, సంపదలు కలిగి వుండాలన్న, సుఖంగా వుండాలన్నా, ఈ చక్రం బలంగా వుండాలి. సప్తచక్రాలలో ఈ చక్రం ప్రత్యేకంగా ప్రతిపత్తి కలది. అదే మాదిరిగా నవగ్రహాలలో గురుగ్రహం ఓ ప్రత్యేకమైన శుభగ్రహం. చెడు అలవాట్లు జోలికి పోకుండా, ముందొకటి వెనుకొకటి మాట్లాడక, నాస్తికత్వం వదిలి, చక్కటి వ్యక్తిత్త్వాన్ని అలవర్చుకుంటే ఈ గ్రహం, చక్రం సక్రమంగా పనిచేస్తాయి.\n" +
                "\n" +
                "శ్రీ శంకరాచార్యులవారు సౌందర్యలహరిలో చెప్పిన వర్ణన బట్టి ఇది జలతత్త్వం గలది.\n" +
                "\n" +
                "తటిత్వం తం శక్త్యాతిమిర పరిపంథి స్పురణయా\n" +
                "స్పురన్నానారత్నాభరణ పరినద్ధేంద్రధనుషమ్\n" +
                "తమశ్యామం మేఘం కమపి మణిపూరైక శరణమ్\n" +
                "నిషేవే వర్షంతం హరమిహిరతప్తం త్రిభువనం\n" +
                "\n" +
                "మణిపూరకమందున్న మేఘం శ్యామవర్ణము కలది. అనిర్వాచ్యమైనది. అంధకారాన్ని పోగొట్టు మెరుపుతో గూడినది. నానావిధ రత్నాభరణములచేత చేయబడిన ఇంద్రధనస్సు కలది. ప్రళయాగ్నిచే తప్తంలైన ముల్లోకములను చల్లపరుచును.\n" +
                "\n" +
                "అనాహత చక్రము\n" +
                "హృదయ స్థానమునందున్నది. పండ్రెండు దళములు గలిగి హేమవర్ణము గల వాయుతత్వ కమలము.\n" +
                "\n" +
                "రాకిన్యాంబస్వరూపిణి\n" +
                "- (494) (9 నామములు) (4 వ చక్రము)\n" +
                "అనాహతాబ్జనిలయ, శ్యామాభాయ, వదనద్వయ, దంష్ట్రోజ్జ్వలాయ, అక్షమాలాదిధరాయ, రుధిరసంస్దితాయ, కాళరాత్ర్యాదిశక్త్యౌఘవృతాయ, స్నిగ్ధౌదనప్రియాయ, మహావీరేంద్రవరదాయ. (485 నుండి 493 వరకూ గల నామములు)\n" +
                "\n" +
                "హృత్పద్మే, భానుపత్రే, ద్వివదన లసితాం, దంష్ట్రిణీం, శ్యామవర్ణామ్\n" +
                "చక్రం, శూలం, కపాలం, డమరుపి – భుజైర్ధారయంతీ త్రినేత్రాం\n" +
                "రక్తస్దాం కాళరాత్రి ప్రభ్రుతి పరివృతాం, స్ధిగ్న భక్తైక సక్తాం\n" +
                "శ్రీమద్వీరేంద్ర వంద్యా మభిమత ఫలదాం, రాకినీ, భావయామః\n" +
                "\n" +
                "ఈమె నలుపురంగులో ఉన్నది, రెండు వదనములు ఉన్నాయి. ప్రాణము, అపానము అనే వాయువులు నియంత్రించు రెండు ముఖములు కలది. శిశువు 2 వ మాసములో రెండవ రంధ్రము ఏర్పడుతుంది. రెండు కోరలతో ప్రకాశించునది. ‘అ’ కారాది, ‘క్ష’ కారము వరకూ గల అక్షరాలని మాలగా ధరించింది. నాలుగు చేతులలో అక్షమాలా, శూలము, కపాలము, డమరుకము, దరించునది. అనాహత చక్రము హృదయమునకు సంబంధించినది, కావున ఆమె రక్త ధాతువుని ఆశ్రయించి ఉంటుంది. అనాహతమునకు 12 దళములు. వీటిని ‘క’ కారమునుండి ‘ ఠ ‘ కారము వరకూ గల 12 అక్షరాలతో ప్రారంభమయే 12 దేవతలచే కొలవబడింది. కాళరాత్రి మొదలగు దేవతలు. నేతితో తడిసిన అన్నము అనిన ప్రీతి కలది. మహావీరుల కోరికలు తీర్చేది. రాకిణీ దేవత సంబంది బీజాక్షరములు, కీలక, న్యాస మంత్రములు అన్నీ ‘ర’ కారము సంబంధమైనవి.\n" +
                "\n" +
                "క’ కారమునుండి ‘ ఠ ‘ కారము వరకూ గల 12 అక్షరాలతో ప్రారంభమయే 12 దేవతలు \"ద్వాదశ శక్తులు\". అవి 1. కాళరాత్రి 2. ఖాతీత, 3. గాయత్రి 4. ఘంటాధారిణి 5. జామిని 6. చంద్రా 7. ఛాయా 8. జయా 9. ఝుంకారి 10. జ్ఞానరూప 11. టంకహస్తా 12. ఠంకారిణి\n" +
                "\n" +
                "విశుద్ధి చక్రము\n" +
                "కంఠ స్థానమందున్నది. పదునారు దళములు గలిగి శ్వేత వర్ణము గల ఆకాశతత్వ కమలము.\n" +
                "\n" +
                "డాకినేశ్వరి: - (484) : (5 వ చక్రము) విశుద్ధి చక్ర అధిష్టానదేవత “డాకిని”. (475 నుండి 483 వరకూ డాకిని దేవత లక్షణాలు వర్ణించబడినవి.) ఆరక్తవర్ణాయ, త్రిలోచనాయ,ఖట్వాంగాది ప్రహరణాయ, వదనైకసమన్వితాయ, పాయసాన్నప్రియాయ, త్వక్ స్ధాయ,పశులోకభయంకరాయ, అమృతాధి మహాశక్తిసంవృతాయ. (8 నామములు)\n" +
                "\n" +
                "గ్రీవాకూపే, విశుద్దే, నృపదళకమలే, శ్వేతరక్తాం, త్రినేత్రాం\n" +
                "హస్తే : - ఖట్వాంగ, ఖడ్గౌ, త్రిశిఖమపి, మహాచర్మ సంధారయంతీమ్\n" +
                "వక్త్రేణేకేనయుక్తాం, పశుజనభయదాం, పాయసాన్యైక సక్తాం\n" +
                "త్వక్ద్సా వందేహమృతాద్యై: పరివృతవపుషాం, డాకినీo, వీరవంద్యామ్.\n" +
                "\n" +
                "డాకినీ దేవత బీజాక్షరాలు, కీలక, న్యాస మంత్రాలు ఆన్నీ “డ” కార సంభంధమైనవి. డాకినీ వర్ణము ఎఱుపు. ఈమె ఎఱ్ఱని ఎఱుపు కాదు. తెలుపు కలసిన ఎరుపు. జీవి పిండ దశలో ‘శుక్త + రక్త “ సమ్మేళనంతో బిందురూపముగా ఉండును. పదిహేను రోజుల పిదప బుడగ రూపము చెంది, నెలాఖరుకి గట్టిపడి, 45 రోజులకి పిండాకృతి పొందుతుంది. ఈ పిండ స్థితి డాకినీ స్థితి. ఈమె త్రిలోచన – భూత, భవిష్యత్, వర్తమానాలు చూడగలది. ఖట్వాంగము, ఖడ్గము, త్రిశూలము, చర్మము ఆయుధములుగా గల దేవత. బీజాక్షరములు = ఖ, ఛ, ఠ, ధ, ఫ -- ఘ, ఝ, ఢ, ధ, భ.\n" +
                "\n" +
                "ఆజ్ఞా చక్రము\n" +
                "భ్రూ (కనుబొమల) మధ్యమందున్నది. రెండు వర్ణములతో గూడిన రెండు దళములు కలిగిన కమలము.\n" +
                "\n" +
                "హాకినీరూపధారిణి (527):- ( 6 నామములు) (6 వ చక్రము)\n" +
                "521 నుండి 526 వరకూ గల నామములు ఈమెను వివరిస్తాయి. ఆజ్ఞాచక్రాబ్జనిలయా, శుక్లవర్ణా, షడాననా, మజ్జాసంస్దాయ, హంసవతీ ముఖ్యశక్తి సమన్విత, హరిద్రాన్నైకరసిక.\n" +
                "\n" +
                "భ్రూమధ్యే బిందుపద్మే దళయుగ కలితే, శుక్లవర్ణాం, కరాబ్జైమ్\n" +
                "విభ్రాణాo జ్ఞానముద్రాం, డమరుకమలా, మక్షమాలాం, కపాలం\n" +
                "షట్చక్రాధారమధ్యామ్, త్రినయన లసితాం, హంస వత్యాది యుక్తాం,\n" +
                "హరిద్రాన్త్యైక సక్తాం, సకలశుభకరీం, హాకినీం భావయామః\n" +
                "\n" +
                "ఆజ్ఞా చక్రము భ్రూ మధ్యలో అనగా రెండు కనుబొమ్మలు కలిసే ప్రాంతములో ఉంటుంది. వివేక సూర్యుని ఉదయం జరిగే ప్రదేశము. దీనికి అధిష్టానదేవత హాకిణీ. ఈమె తెలుపు రంగులో ఉంటుంది. ఈమె త్రికాలజ్ఞాని. ఈ దేవతకి ఆరు ముఖములు. ఆరు కృతికలు, కుమారస్వామి ఆరు ముఖములు ఈమె రూపములే. ఆజ్ఞాచక్రం మనస్సుకి స్ధానం. గర్భస్ధ శిశువు ఆరవ మాసములో పంచేద్రియాలతో బాటు మనస్సు కూడా ఏర్పడుతుంది. ఈమె ఎములకలోని మజ్జ అనగా మూలగను ఆశ్రయించి ఉంటుంది. ఇది రెండు దళముల పద్మము. బీజాక్షరములు ‘హ’ ‘క్ష’ . హంసవతీ, ‘క్షమావతీ; అనే దేవతలు ఈ పద్మముని ఆశ్రయించారు. పసుపు పచ్చని అన్నమును ఇష్టపడుతుంది.\n" +
                "\n" +
                "సహస్రార చక్రము\n" +
                "బ్రహ్మ రంధ్రమునకు అధోముఖముగ సహస్ర దళములతో వికసించియున్న పద్మము. సహస్రార కమల కర్ణిక యందు ప్రకృతి పురుషుల సమైక్య స్థితి యగు పరబిందువు చుట్టును మాయ గలదు. ఆత్మజ్ఞానమును సాధించిన పరమ హంసలు మాత్రమే పొందగలిగిన స్థానమిది. దీనిని శైవులు శివస్థానమనియు, వైష్ణవులు పరమ పురుష స్థానమనియు, ఇతరులు హరిహర స్థానమనియు, దేవీభక్తులు దేవీస్థానమనియు చెప్పుదురు. ఈస్థానమునెరిగిన నరునకు పునర్జన్మ లేదు.\n" +
                "\n" +
                "యాకిన్యంబస్వరూపిణి:- (534) (6 నామములు) (7 వ చక్రము)\n" +
                "528 నుండి 533 వరకూ నామములు ఈమెను తెలెయ చేస్తాయి. (సహస్త్రదళ పద్మస్ద, స్వర్ణవర్ణోపశోభిత, సర్వాయుధధర, శుక్లసంస్దితా, సర్వతోముఖ, సర్వోదనపీతిచిత్తాయ)\n" +
                "\n" +
                "ముండవ్యోమస్ధ పద్మే దశశతదళకే కర్ణికా చంద్రసంస్దామ్\n" +
                "రేతో నిష్టాం, సమస్తాయుధ కలితకరాం, సర్వతోవక్త్రపద్మాం\n" +
                "ఆది క్షాన్తార్ణశక్తి ప్రకట పరివృతామ్ స్వర్ణవర్ణాం భవానీం\n" +
                "సర్వాన్నాసక్తచిత్తామ్, పరశివరసికాం యాకినీ భావయామః\n" +
                "\n" +
                "శిరస్సు మధ్యభాగములో సహస్త్రాకార చక్రము ఉంటుంది. ఇది వేయి దళములు కలది. యశస్వనీ దేవత ఈ చక్ర అధిష్టానదేవత. ఈ 7వ మాసములోనే గర్భస్ధ శిశువులో జీవుడు ప్రవేశించేది. ఇందు విశ్వంలోని సకల వర్ణములు, రంగులు, అక్షరములు, విద్యలు, ధ్వనులు, బీజాక్షరములు ఉంటాయి. యశస్వినీ దేవతకు లెక్కలేనన్ని చేతులు, అన్ని చేతులలో సకల ఆయుధములు ధరించునది. ఈమె సృష్టికి ఆధారభూతమైన శుక్ర ధాతువుని ఆశ్రయించునది. ఈమె సర్వతోముఖ అభివృద్ధి చేయునది. ఈమె అన్ని రకముల అన్నమునూ ఇష్టపడుతుంది.\n" +
                "\n" +
                "ఇంతవరకు 'స్మరణ' యందు వివరించిన ఆరు చక్రాలను షట్చక్రములుగా పేర్కొంటారు. ఏడవది సహస్రారంగా వర్ణిస్తారు. ఇందు మొదటి ఆరింటి యందును ప్రజ్ఞ మేల్కొని పరిపూర్ణత చెంది, ఏడవది యగు సహస్రారమందు లయము చెందుటయే యోగం. ఇదియే మోక్షం. ఇదియే నిర్వాణం. ఇదియే అద్వైతస్థితి.\n" +
                "\n" +
                "ఆజ్ఞా విశుద్ధి చక్రములు సత్వగుణమునూ, అనాహతం మణిపూరక చక్రములు రజోగుణమునూ, స్వాధిష్టానం, మూలాధార చక్రములు తమోగుణమును వ్యక్తం చేయును. తమోగుణం దేహధాతువుల నిర్మాణమునకు, వానియందలి రసాయనిక మార్పులకు ఆధిపత్యం వహించడమే కాకుండా భౌతికదేహ నిర్మాణం కూడా దీని ప్రవృత్తియే.\n" +
                "\n" +
                "రజస్సు వలన శరీరం లోని వివిధ అవయములు పనిచేయుచున్నవి. ఇక సత్వం వలన గ్రహణశక్తి, వివేకం, విచక్షణ, విమర్శన మున్నగు లక్షణములు మేల్కొనును. ఈ మూడును మూడు లోకములుగా అంటే, భూలోకం (తమస్సు), భువర్లోకం (రజస్సు), సువర్లోకం (సత్వం)లుగా మనదేహంనందునూ, సౌరమండలం నందునూ ఏర్పడుచున్నవి.\n" +
                "\n" +
                "సహస్రారచక్రం\n" +
                "-\n" +
                "సహస్రదళపద్మస్థా సర్వవర్ణోపశోభితా సర్వాయుధధరా శుక్లసంస్థితా సర్వతోముఖా సర్వౌదన ప్రీతచిత్తా యాకిన్యంబా స్వరూపిణీ\n" +
                "\n" +
                "ఈ కమలం వేయిదళాలతో వికసించి యుంటుంది. అధిదేవత యాకిని. అకారాది క్షకారంత వర్ణమాల యోగినీగణం చేత సేవించబడుచున్నది. ఈమెకు సర్వాన్నం ప్రీతి.\n" +
                "\n" +
                "మస్తిష్కం పైన బ్రహ్మరంధ్రం క్రిందిభాగమున విలసిల్లే ఈ చక్రం విశ్వాత్మ నివాసస్థానం. పరమాత్మ స్థానం. ఇది మానసికంగా సంపూర్ణ ఆధ్యాత్మిక చక్రం. ఆత్మసాక్షాత్కారానికి దోహదం చేసే చక్రం. ఆత్మశక్తి అలరారే సుందర సుదర్శన చక్రం. విశ్వచైతన్యం వ్యక్తిచైతన్యంగా పరిఢవిల్లే కమలం ఈ సహస్రారం. పరిపూర్ణ జ్ఞానానికి ప్రతీక. ఆనందమయకోశంతో సంబంధం.\n" +
                "\n" +
                "ఈ చక్రం శక్తివంతంగా లేకపోతే - షట్చక్రాలు బలహీనపడతాయి. గ్రహణశక్తి లోపిస్తుంది. భూత వర్తమానాలోనికి పయనిస్తూ అలసిపోతుంటారు. కష్టదుఃఖాలు పొందుతుంటారు. పునర్జన్మలు తప్పవు. ఈ చక్ర మానసిక స్వభావం - ఈ చక్రం జాగృతయితే సాధకుడు అమరుడౌతాడు. పరమాత్మగా వ్యక్తమౌతాడు. తనకు తాను తెలుసుకుంటాడు. ఇది ఈశ్వరీయత స్థితి. ఈశ్వరత్వం పొందుతారు. ఈ చక్రమును శుద్ధిచేసుకోవాలంటే - తలపు, మాట, చేత యోగ్యంగా వుండాలి. క్రమశిక్షణ, ఆచరణ, విశ్వాసం కలిగియుండాలి. ధ్యానం, బ్రహ్మతత్త్వజ్ఞానం, స్థితప్రజ్ఞ (గతాన్ని తలవక, భవిష్యత్తు ఊహించక, వర్తమానంలో వర్తించడం అంటే ఏ క్షణానికి ఆ క్షణంలో జీవించడం) ప్రశాంత వాతావరణం ఏర్పరచుకోవడం చేయాలి. ఇక ఈ చక్రంనకు అధిపతి గ్రహం 'సూర్యుడు'. ఋజువర్తన, నాయకత్వలక్షణాలు, అందర్నీ ఆకట్టుకునే ఆకర్షణీయశక్తి, సునిశితమైన చూపులు, విశాలమైన నుదురు, ఎందులోనూ ఓటమిని పొందని, మాటపడని తత్త్వం, విభిన్నమైన ఆలోచనావిధానంతో విజయమును సాధించే కార్యదక్షత సూర్యుని లక్షణాలు. సాధన ద్వారా ఈ లక్షణాలను పెంపొందించుకుంటే సహస్రారం శక్తివంతమై, తద్వారా ఈ చక్రంతో అనుసంధానింపబడియున్న షట్చక్రాలు శక్తిసామర్ధ్యాలు కలిగియుండి మనజీవితములు ఆనంద నందనవనములు అవుతాయి.\n" +
                "\n" +
                "ప్రతీరోజూ సూర్యోదయ సమయానికి స్నానపానాదులు ముగించుకొని సూర్యునికి ఎదురుగా కూర్చొని, సూర్యోపాసన చెయ్యాలి. అంటే సూర్యకిరణాలు తాకిడిని అనుభవిస్తూ, సూర్యభగవానుని శక్తి మన సహస్రారం గుండా అన్నిచక్రాలయందు నిబిడీకృతమవుతున్నట్లు భావిస్తూ, ప్రశాంతచిత్తంతో కాసేపు ధ్యానించాలి. క్రమం తప్పని ఈ ఆచరణ వలన సూర్యభగవానుని శక్తి, గాయత్రి శక్తి మనకు లభించి తేజోమూర్తులవుతాం. కుండలినీశక్తి స్థూల శరీరం నుండి ప్రజ్ఞామయ శరీరం వరకు వ్యాపించియున్నది. ఈ శక్తిని చైతన్యవంతం చేయాలి. ఆయా చక్ర దేవతలను ప్రార్థించాలి. {ప్రార్థన అంటే దైవస్మరణ మాత్రమే కాదు, మన మనస్సును ఇహం నుండి పరం వైపు త్రిప్పడానికే అన్న నిజాన్ని అర్ధంచేసుకొని, దేహమే దేవాలయమని, అంతరాన్నే అంతర్యామి కొలువై వున్నాడని గ్రహించి అందుకు తగ్గ ప్రార్థన చేయాలి}. ప్రకృతి సహజంగానే ప్రతీ మనిషికి కొంతశక్తి వస్తుంది. కొన్ని అవకాశాలు కల్పిస్తుంది. వచ్చిన అవకాశాలను అందుకుని, వున్నశక్తిని ఉపయోగించుకుంటూ ఆత్మశక్తిని పెంపొందించుకోగలగాలి. ఈ విధమైన సాధనే ఆధ్యాత్మిక ఉన్నతికి మార్గం సుగమం చేస్తుంది.\n" +
                "\n" +
                "ఈ సాధన వలన ఆలోచనల్లో స్పష్టత, నడవడికలో సరళత, దృక్పదంలో విశాలత, అందర్నీ ప్రేమించగల సౌశీల్యత, ఆదరించగల సేవాతత్పరత, అన్ని పరిస్థితులలోనూ సంయమనం, స్థితప్రజ్ఞత అలవడతాయి. నేను అనెడి అహం నశిస్తుంది. 'నేను' అనెడి సంకుచిత స్వాభిమానమదృశ్యమైనచో అనంతమగు 'అహంబ్రహ్మస్మి' అనెడి ఉత్తమస్థితి తనంతటదియే సాక్షాత్కారమగును. అప్పుడు ఆనందం ఓ స్రవంతిలా ప్రవహిస్తుంది. సహజత్వానికి దగ్గరగా ఉండటమే. ఈవిధంగా సరైనరీతిలో సప్తచక్రాలను సాధన చేస్తే, సంసారంలో తిరిగి జన్మింపరు. మనలో వున్న సప్తచక్రాలను చైతన్యవంతం చేసే సాధనతో స్థూలంనుండి ప్రజ్ఞామయం వరకు పయనించి 'అహం బ్రహ్మస్మి' అన్న స్థితిని పొందడమే జీవన పరమావధి.";
        textView.setText(para);
        textView.setMovementMethod(new ScrollingMovementMethod());
    }
}
