package com.example.soundarya_lahari_telugu;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Main7Activity extends AppCompatActivity {
TextView textView;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main7);


        textView=(TextView)findViewById(R.id.text7);
        String para="\n  శ్రీ చక్రం లేదా శ్రీ యంత్రం (Sri Chakra or Shri Yantra) కాశ్మీరీ హైందవము ఆధారితమైన తంత్రము లో ఒక పవిత్రమైన యంత్రం. దీని జ్యామితీయ నిర్మాణము ఒక బిందువు చుట్టూ వివిధ దిశలలో ప్రయాణిస్తూ ఉన్న చిన్న చిన్న త్రిభుజాలు చివరకు రెండు వ్యతిరేక దిశలలో ఉద్భవించే పెద్ద త్రిభుజాల వలె ఉంటుంది. ఈ యంత్రము శక్తి స్వరూపిణులైన శ్రీ విద్య, లలితా దేవి లేదా త్రిపుర సుందరి అనే దేవతను సూచిస్తాయి. దీనిలోని నాలుగు సమద్విబాహు త్రిభుజాలు ఉర్ధ్వముఖంగా ఉండి శివుణ్ణి లేదా పురుష శక్తిని సూచిస్తాయి. అయిదు సమద్విబాహు త్రిభుజాలు నిమ్మముఖంగా ఉండి శక్తిని లేదా స్త్రీని సూచిస్తాయి. కావున శ్రీ చక్ర యంత్రము వ్యతిరేక దివ్యశక్తుల సంగమముని సూచిస్తుంది. ఇందులో త్రిభుజాలు మొత్తం తొమ్మిది ఉన్నందున దీనిని నవయోని చక్రం (Navayoni Chakra) అని లేదా నవ చక్రం (Nava Chakra) అని కూడా పిలుస్తారు.[1]\n శ్రీ చక్ర భాగాలు\n" +
                "శ్రీ చక్రం లోని ఒక్కొక్క భాగం త్రిపుర సుందరి యొక్క సూచికగా భావిస్తారు. బయటి నుండి లోపలికి వెళ్ళే దిశలో శ్రీ చక్ర భాగాలు-\n" +
                "\n" +
                "మూడు సమాంతర రేఖలతో కూడుకుని ఉన్న చతురస్రాకారము - త్రైలోక్య్య మోహనం లేదా భూపం\n" +
                "పదహారు రేకులు గల వృత్తము - సర్వ ఆశా పరిపూరకము\n" +
                "ఎనిమిది రేకులు గల వృత్తము - సర్వ సంక్షోభనము\n" +
                "పధ్నాలుగు చిన్న త్రిభుజాలు - సర్వ సౌభాగ్యదాయకము\n" +
                "పది చిన్న త్రిభుజాలు - సర్వ అర్థసాధకాలు\n" +
                "పది చిన్న త్రిభుజాలు - సర్వ రక్షకాలు\n" +
                "ఎనిమిది చిన్న త్రిభుజాలు - సర్వ రోగహరింపులు\n" +
                "మధ్యనున్న ఒక త్రిభుజం - సర్వ సిద్ధిప్రద\n" +
                "బిందువు - సర్వ ఆనందమయి\n" +
                "వివరణ\n" +
                "కుయ్పర్ కే అనే రచయిత, Understanding India: The Culture of India అనే తన పుస్తకంలో శ్రీ చక్రం గురించి ఈ విధంగా తెలిపాడు.\n" +
                "\n" +
                "వివిధ పరిమాణాలలో ఉన్న ఈ తొమ్మిది త్రిభుజాలు, ఒకదానితో ఒకటి కలుస్తాయి. వీటి మధ్యలో మానవ నేత్రానికి అందనంత, అత్యున్నత స్థానం కలిగిన, అనంతమైన కేంద్రంలో బిందువు రూపంలో శక్తి ఉంటుంది. ఈ కేంద్రము నుండే సమస్త విశ్వము వ్యాపిస్తుంది. ఈ త్రికోణాల చుట్టూ ముందు సృష్టిని సూచించే ఎనిమిది రేకులు గల వృత్తము, దాని తర్వాత పునరుత్పత్తిని సూచించే పదహారు రేకులు గల వృత్తములు ఉంటాయి. వీటి చుట్టూ నాలుగు దిశలలో పవిత్ర స్థలానికి ద్వారాలు ఉంటాయి.\n" +
                "బిందువు అంతరాలలో కామకళ నిగూఢమై ఉంటుంది. దీనికి మూడు రకాల శక్తులు ఉంటాయి. అవి\n" +
                "\n" +
                "ఎరుపు - అండము\n" +
                "తెలుపు - వీర్యము\n" +
                "రెండిటి కలయిక - శివశక్తుల సంగమము. ఈ సంగమమే శ్రీ చక్ర కారకము.\n" +
                "వామకేశ్వర తంత్రము\n" +
                "వామకేశ్వర తంత్రము రెండవ భాగమైన యోగినీ హృదయలో శ్రీ చక్రం గురించి ఈ విధంగా చెప్పబడింది.\n" +
                "\n" +
                "స్త్రీ శక్తి నుండి సృజనాత్మకం పురుష శక్తి నుండి అగ్ని వెలువడతాయి. వీటి సంయోగము తోనే చక్రము ఆవిర్భవిస్తుంది. ఇదే చక్రము యొక్క మూలము\n" +
                "మహోన్నతమైన స్త్రీ శక్తి స్వేచ్ఛగా సృష్టి అనే రూపాంతరము పొందినది. దీనికి ప్రతిస్పందనగా చక్రము యొక్క సృష్టి కూడా జరిగింది. ఈ ప్రకంపనలతో శూన్యముని పోలిన విసర్గ (:) వలె చైతన్య స్థితిలో బిందువు ఉద్భవించింది. దివ్య శక్తి యొక్క ఈ స్థిర ప్రవాహంలో సంపూర్ణమైన వ్యవస్థ అనే సముద్రము అవతరించింది. ఇదే ముగ్గురు అమ్మల మూలపుటమ్మ\n" +
                "చక్రంలో బైందవము (బిందువు)కి మూడు రూపాలు ఉన్నాయి. ధర్మము, అధర్మము, ఆత్మ. మాత్రి, మేయము, ప్రమము. నవయోని చక్రము చైతన్యానికి, అనంత సౌఖ్యానికి సూచిక. మంత్రము యొక్క తొమ్మిది విభాగాలు కలది.\n" +
                "తంత్రశాస్త్రము- శ్రీ చక్రం\n" +
                "శివశక్తుల సంయోగమే శ్రీ చక్రం.ఈ చక్రం మధ్యలో బిందువైన బీజము నుండి సమస్తలోకాలు, భూతాలు పుట్టినవి. కనుక శ్రీ చక్రము సమస్త కామిత ఫలము. ఆదియందు పరమేశ్వరుడు ఒక్కొక్క కామ్యమునకు ఒక్కొక్కతంత్ర శాస్త్రం చొప్పున 64 తంత్ర శాస్త్రములను చెప్పాడు. కామ్యములన్నింటిని పొందుటకు 64 తంత్రములను పూజించుట కష్తసాధ్యమని పరమేశ్వరుని సులభమార్గం చూపించమని దేవతలు ప్రార్థించగా పరమేశ్వరుడు శ్రీవిద్యోపాసనను ప్రసాదించాడు. త్రిపురసుందరి, శ్రీ చక్రము, శ్రీ విద్యామంత్ర ఉపాసనలే శ్రీ విద్యోపాసన. దీనివల్ల సమస్త కామ్యములు లభించును. ఇందులో 12 సంప్రదాయములు ఉన్నాయి.\n" +
                "\n" +
                "శ్రీ చక్రము, సహస్రారకమలము ఒకటే.బహిఃపూజలకు శ్రీయంత్రమును ఉంచి పూజిస్తారు.అంతః పూజలకు సహస్త్రారపద్మం. దీనిలోని బిందువు నుండే పంచభూతాలు, సమస్తం పుట్టినవి.అందుకే '''సుధాసింధో ర్మధ్యే''' అని అమ్మవారిని పూజిస్తారు. దీని అర్ధం ఇది: అమృతసముద్రం మధ్యలో మణిద్వీపం ఉంది. దానిలో కల్పకోద్యానవనము.దానిలో నీపోపవనం ఉంది. దీని మధ్య చింతామణిగృహం ఉంది.దీనిలో మంచంమీద పంచబ్రహ్మాకారంలో ఉన్న రత్న సింహానం మీద పరమశివుని పర్యంకం మీద చిదానందలహరి అయిన అమ్మవారు శ్రీదేవీ ఉంది.ఈమెయే శ్రీ చక్రోపాసనకు మూల దేవత. ఈ దేవిని గూర్చి వ్రాయబడిన ఆంధ్రలలితోపాఖ్యానములో ఇలా ఉన్నది: భర్తమాట ధిక్కరించి పార్వతి దేవి తండ్రి దక్షుడు యజ్ఞం వద్దకు వెళ్ళగా తండ్రి ఆమెను తిరస్కరించగా యోగాగ్నిచేత భస్మమైంది. దేవి పద్మాసనంలో కూర్చొని, ప్రానములను బంధించి మూలాధార చిద్వహ్నిని నెగయించి, నాసాగ్రనయనయై చిదగ్నిని ప్రజ్వలింపజేసింది, ఈ అగ్ని ఆమె శరీరాన్ని భస్మరాసికూడా లేకుండా దహింపజేసింది. చిదగ్ని ఆటం అగ్ని ఒకటే అయిఉండవచ్చు. పార్వతీదేవి పర్వతరాజుకు కూతురుగా పుట్టింది. నారదులవారు పర్వతరాజు వద్దకువచ్చి నీతనయ చతుర్దశ జగన్మాత యైన పరమేశ్వరి అని చెప్పాడు.ఈమెను పరమేశ్వరునికి భార్యగా చేయవలెనని, పరమేశ్వరుని వద్ద వుంచాడు. పరమేశ్వరుడు మహాతపస్సులో ఉండి కన్ను తెరచి చూడలేదు. ఇంద్రుడు మన్మధుడుని బ్రతిమాలగా, అపుడు తనమిత్రుడు వసంతుని, సేనాని చంద్రుడు సాయంతో కామ బాణం ప్రయోగించగా నిర్వికల్పస్థితిలో ఉన్న ఈశ్వరుని మనస్సు చలించి కళ్ళు తెరచి చూడగా నేత్రాగ్ని వలన మన్మధుడు భస్మం కాగా అందులోంచి భస్మాసురుడు పుట్టినాడు. మన్మధుడు లేకపోయినందువలన ప్రపంచము రసహీనమైనది. ఆఖ్రికి చెట్లు కూడా పుష్పించుట లేదు. పశుపక్షిమానవసృష్టి ఆగింది. ఇందుకు గాను ఆది శంభుడు మహాయజ్ఞం చేసి అందులో దేవతలను, త్రిమూర్తులను వ్రేల్చాడు. ఆ అగ్నికుండం నుంచి శ్రీ త్రిపుర సుందరి లలితా దేవి ఆవ్ర్భవించింది. ఈ జగజ్జనని మళ్ళా సృష్టిని చేసింది.అటుపై ఆమె భస్మాసురునితో తీవ్ర యుద్ధం చేసి ఆతడిని వధించింది. ఈ యుద్ధం శూన్యకపురంలో జరుగింది. అందులో పురమూ, భస్మాసుర్డుడు భస్మం అయినారు.ఇందులో అమ్మవారుని మహా పద్మాటవీ వర్ణన చేయబడెను. లలితాంబ యోగినీ చక్రదేవి పంక్తియందు 19వ సంఖ్య.దీనిమీద నాదాంతరమనే స్థానము ఉంది. అందులో వేయిసూర్యుల ప్రకాశం గల బింధుపీఠం ఉంది.ఇదే శ్రేపీఠం.శ్రీదేవి శ్రీనగరమును పాలించుచు భక్తుని భీష్మములను ఇచ్చుచు, ఈకథకు, యత్రంలో ఉన్న శ్రీ చక్రమునకు, శ్రీవిద్యకు, సహస్రారంలో ఉన్న సుధాసింధువునకు ఏకసంబంధం ఉంది.\n" +
                "\n" +
                "మంత్రం శబ్దంనుండి, శబ్దము ఆలోచననుండి పుట్టినవి. శబ్దము వల్ల శబ్ద తరంగాలు బైలుదేరుతవి. ఈ తరంగాలు చక్రాకారంగా ఉండును.ఆయా శబ్దమును బట్టి, ఆచక్రాకారమునకు దళములు ఏర్పడును. మంత్రోచ్చారణ వల్ల శరీరములో సూక్ష్మ నాడీ కూటమునందు కొన్ని స్పందనలు కలిగి అవి చక్రరూపం తాల్చును. చైతన్య రూపమును పొందిన ఈ సూక్ష్మ చక్రములు విశ్వ ప్రాణమును ఆకర్షించి శక్తివంతములగును. ఈవిధముగా శబ్దసమూహమైన మంత్రము చైతన్యవంతమై సిద్ధి ప్రదమౌను.\n" +
                "\n" +
                "మానవుని వెన్నుముఖలో సూక్ష్మరూపమున సుషుమ్నయనే నాడి ఉంది. ఇది నిటారుగా ఉంది. ఇదే క్రింది మానసికశక్తులకు, ఉన్నత మానసికశక్తులకు కలుపునాడి. దీనిలో 7 చక్రములున్నవి. క్రింది 5 చక్రములు పంచభూతములు. ఆభూత సంబంధమైన అక్షరములు ఆకారములు దేవతలు దాహనములు బీజాక్షరములు. మొదటిదైన ఆకాశము భూతంగల చక్రం కంఠం దగ్గర సప్తచక్రాలు లలో సుషుమ్నానాడి ఉఅందున్నది. అక్షరములలో అచ్చులు ప్రధానములు. అ, ఆ మొదలైనవి అచ్చు అక్షరములు ఈచక్రంలో ఉన్నాయి. విశుద్ధి చక్రము అంటారు.తరువాత వాయువు అనాహత చక్రములో ఉంది. హల్లులు మొదటిదైన అక్షరము మొదలుకొని ద వరకు ఈ చక్రంలో ఉన్నాయి. దీని తరువాత అగ్నిభూతం గల మణిపూరక చక్రము దీనిలో ధ నుండి ఫ వరకు 10 అక్షరములు ఉన్నాయి. దీని క్రింద ఉన్న స్వాధిష్ఠాన చక్రములో జలభూతము బ నుండి ల వరకు 6 అక్షరములు ఉన్నాయి. అన్నిటికన్న క్రింద ఉన్న మూలాధార చక్రము పృధివీ భూతము వ నుండి స వరకు అక్షరములున్నవి. అటుపై విశుద్ధచక్రంపైన భ్రూస్థానం వద్ద ఆగ్నేయచక్రం ఉంది. ఉందులో మనస్తత్వం, బ్రహ్మబీజాక్షరములైన హ, క్షలు రెండు ఉన్నాయి. వీటితో మొత్తం 50 అక్షరములు అవును. 20X50 = 1000 అక్షరములపైన సహస్రారంలో ఉన్నాయి. మనము ఏ అక్షరమును పలికినా అ అక్షరమునకు సంబంధించిన శక్తి పుట్టును అని. శ్రీ చక్రంలో ఒక ఉద్దేశము.\n" +
                "\n" +
                "స్తోత్రము\n" +
                "ఇది శ్రీ చక్రాన్ని వర్ణించే శ్లోకము. శ్రీ చక్రం అమ్మ నివాస స్దానమ్.శ్రీ చక్రంలో తొమ్మిది ఆవరణలు ఉన్నాయి. ఈ తొమ్మిది ఆవరణలను అర్చించుటయె శ్రీ చక్రనవావరణార్చన. ఇది అమ్మకు చాలా ప్రియమైన అర్చన.\n" +
                "\n" +
                "శ్రీచక్రంలో అమ్మవారికి చుట్టూ ఎనిమిది దిక్కులలో ఎనిమిది మంది మాతృకలు స్థాపించబడ్డారు..వీరు అమ్మవారికి అష్టదిగ్భంధనగా ఉన్న రక్షణ కవచాలు .. వీరినే అష్టమాతృకలు అని పిలుస్తాం.. వీరిలో తూర్పువైపున బ్రాహ్మీ, దక్షిణమున మహేశ్వరి, పశ్చిమం కౌమారి, ఉత్తరం వైష్ణవి, ఆగ్నేయం వారాహీ, నైరుతి మాహేంద్రి, వాయువ్యం చాముండి, ఈశాన్యం మహాలక్ష్మి అమ్మవార్లు ఉంటారు.. అష్టమాతృకలతో శ్రీయంత్రం అష్టదిగ్భంధనగా చేయబడింది.. దీనికి తంత్రమార్గంలో చాలా గొప్ప ప్రాముఖ్యత ఉంది.. శ్రీచక్ర తంత్రం తెలిసిన వారు సిద్ది పొందినవారికి లోకంలో ఎటువంటి ఎదురు ఉండదు.. వారే గొప్ప శక్తివంతులు, వారిని ఎంతటి క్షుద్రప్రయోగాలు ఏమీ చేయలేవు..ఈ శ్రీచక్రంతో అష్టదిగ్భంధనం చేయబడిన గృహానికి ఆ గృహంలో నివసించే వారికి ఎటువంటి ఆపదలు, ఆర్థిక బాధలు, క్షుద్ర ప్రయోగాలు దరిచేరలేవు.. ఇలా జరగాలంటే గృహస్థు కూడా ఇంటిలో ప్రతిష్ఠించబడిన శ్రీచక్రానికి విధిగా పూజాధికాలు నిర్వహిస్తూ నైవేద్యం సమర్పించాలి.. * ";
        textView.setText(para);
        textView.setMovementMethod(new ScrollingMovementMethod());
    }
}
